{
  "main": {
    "name":"Zhenyu Sun(Joe)",
    "summary": "I am a Computer Science & Optimization Student in University of Waterloo. I am familiar with the development tools and cycles with over a year's experience in the industry, currently looking for an internship this fall(2020)",
    "occupation":"(Your Occupation Here)",
    "description":"We will further improve this project by using Emotion.js for styling and possibly next.js",
    "image":"photo.jpeg",
    "bio":"I am at my fourth year in University of Waterloo. I am studying Computer Science and Optimization, with skills learned from Computer Science and mathematical knowledge from Optimization, I am able to combine them together to solve and optimize complicate problems. I have been worked as software developer, full stack-developer and front-end developer in various companies across North America",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "sunzhenyu1998411@outlook.com",
    "phone": "226-268-2127",
    "address":{
      "street":"729 Cedar Bend Drive",
      "city":"Waterloo",
      "state":"Ontario",
      "zip": "N2V 2R2"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/zhenyu-sun-897761156/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/mr.tuuuu/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/szy1998411",
        "className":"fa fa-github"
      },
      {
        "name":"skype",
        "url":"http://skype.com",
        "className":"fa fa-skype"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here is a brief summary of my main skills",
    "education":[
      {
        "school":"University of Waterloo",
        "degree":"Bachelor in Computer Science",
        "graduated":"April 2021(Expected)",
        "description":"I am currently maintaining a major average of 93%. I learned various topics about Computer Science in school. I started from principle of programming followed by courses on Object-Oriented Programming. Further, I studied Sequential Programming, Operating System and Concurrency Programming. In theoretical aspect, I learned Data Structure, Algorithm, Numerical Computation and Complexity Theory. I am mostly interested in Algorithm and Complexity Theory."
      },
      {
        "school":"University of Waterloo",
        "degree":"Bachelor in Mathematics",
        "graduated":"April 2021(Expected)",
        "description":"I am currently maintaining a major average of 92%. I am mostly interested in Discrete Math. I had a broad introduction in Linear Programming, Graph Theory, Enumeration, Coding Theory, Network Flow and Cryptography. With the knowledge of various mathematical fields, I am able to apply them in various aspects of Computer Science, including developing and optimizing graph algorithm."
      }
    ],
    "work":[
      {
        "company":"Yahoo(Verizon Media)",
        "title":"Software Engineer",
        "years":"January 2020 - March 2020",
        "description":"I mostly worked as front-end developer during my time in Yahoo. I mainly focused on UI redesign of Athenz, a open source platform. We rewrote the UI in React and Next.js followed by intergration of Redux. The use of Next.js allowed us to separate work by pages and I wrote a third of the pages independently. I reimplemented the data fetching logic by introducing on-demand fetching and it reduced data loading time from 3s to less than 1s. We also used Emotion.js to remove original nested css classes, this greatly improved the readability of our code."
      },
      {
        "company":"ADP Canada Inc.",
        "title":"Software Developer",
        "years":"May 2019 - August 2019",
        "description":"I was in a mobile app team in ADP. We mainly used React and Redux for development. I mainly focused on the maintainance of our existing product, a payroll management system. I completed over 20 defect tickets on UI side, including text misalignment, button mispositioning and incorrect image size. I also fixed a group of flex display issue by restructuring the grid classes. I also did some development tasks. For example, I added a new information dialog after user's login."
      },
      {
        "company":"Delego Software Inc.",
        "title":"Software Developer",
        "years":"September 2018 - December 2018",
        "description":"I was in a web development team. We featured on providing payment platforms. During the first half of my work term, I was focusing on the maintainance of our current payment website. The website is in Angular and Java. I was on the Java side and I completed some injection configurations and adding JUnit tests. I moved to the development of a new website during my second half. I added configurable website icon and fixed data sorting issues. Besides that I also did some build script work in Gradle. I modified some of the build script to bring a faster development build."
      }
    ],
    "skills":[
      {
        "name":"C++/C",
        "level":"75%"
      },
      {
        "name":"React.js",
        "level":"65%"
      },
      {
        "name":"Java",
        "level":"50%"
      },
      {
        "name":"Python",
        "level":"50%"
      },
      {
        "name":"git",
        "level":"55%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Science is what we understand well enough to explain to a computer. Art is everything else we do.",
        "user":"Donald Ervin Knuth"
      }
    ]
  }
}
